Revit 2024 API
LeadersPresentationMode Enumeration
 Leaders Presentation Mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Since: 2023
Syntax
C#
public enum LeadersPresentationMode
Visual Basic
Public Enumeration LeadersPresentationMode
Visual C++
public enum class LeadersPresentationMode
Members
Member name | Description
ShowAll |  Show all tag leaders.
HideAll |  Hide all tag leaders.
ShowOnlyOne |  Show only one leader.
ShowSpecificLeaders |  Show specific leaders.
See Also
Autodesk.Revit.DB Namespace